<body>
<html>

<p>
<i>An Iterated Learning Model of language change that mixes supervised and unsupervised learning.</i><br>
Jack Bunyan, Seth Bullock and Conor Houghton<br>
</p>
<p><strong>Abstract</strong></p>
<p>
The <i>iterated learning model</i> is a simulation of how languages might
evolve as they are passed from one generation to the next. It uses a
highly simplified language: a mapping between vectors of zeros and
ones representing meanings and signals. Nonetheless, it is possible to
test whether the model language is compositional and expressive and,
in the simulation, these properties arise though successive cycles of
learning and generalization. However, while an agent's <i>decoder</i> map
from signals to meanings is a neural network, the complementary
<i>encoder</i> map is calculated in an unrealistic way. Here, we propose a
more realistic model in which both the encoder and decoder are neural
networks, concatenated together as an <i>autoencoder</i>, and pupils are
required to learn from a mix of unsupervised and supervised examples,
as children do. The model suggests that internal reflection on
potential utterances is important in language learning and evolution.</p>

<p><strong>Abstract as Gaeilge</strong></p>
<p>Is &eacute; at&aacute; san <i>iterated learning model</i> ionsamhl&uacute; ar an bhealach a bhf&eacute;adfadh teangacha &eacute;abhl&oacute;id a dh&eacute;anamh agus iad &aacute; n-aistri&uacute; &oacute; ghl&uacute;in go gl&uacute;in. &Uacute;s&aacute;ideann s&eacute; teanga a simpl&iacute;odh go m&oacute;r: map&aacute;il idir veicteoir&iacute; n&aacute;ideanna agus aonta a sheasann do bhr&iacute;onna agus do chomhartha&iacute;. Mar sin f&eacute;in, is f&eacute;idir a th&aacute;st&aacute;il an bhfuil an teanga samplach seo comhdh&eacute;anta eispriseach; san ionsamhl&uacute;, b&iacute;onn na hair&iacute;onna seo mar thoradh ar thimthriallta leantacha foghlama agus ginear&aacute;laithe. F&oacute;s f&eacute;in, c&eacute; gur l&iacute;onra n&eacute;arach &eacute; l&eacute;arsc&aacute;il <i>decoder</i> an ghn&iacute;omhaire &oacute; chomhartha&iacute; go br&iacute;onna, r&iacute;omhtar an l&eacute;arsc&aacute;il chomhl&aacute;ntach <i>encoder</i> ar bhealach neamhr&eacute;ala&iacute;och. Molaimid samhail n&iacute;os r&eacute;ala&iacute;che anseo ina bhfuil an t-ionch&oacute;d&oacute;ir agus an d&iacute;ch&oacute;d&oacute;ir araon ina l&iacute;onra&iacute; n&eacute;aracha agus iad comhcheangailte le ch&eacute;ile mar <i>autoencoder</i>, agus is g&aacute; do dhalta&iacute; foghlaim &oacute; mheasc&aacute;n</a>
</body>
</html>
